iNavFlight/inav/lib/main/ChibiOS/community/testhal/NRF52/NRF52832/RADIO-ESB/nrf52_radio.c
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 * Enhanced ShockBurst proprietary protocol to ChibiOS port
 *
 *  ported on: 25/10/2018, by andru
 *
 */

#include <stdint.h>
#include <string.h>

#include "ch.h"
#include "hal.h"

#include "nrf52_radio.h"


#define BIT_MASK_UINT_8(x) 					  (0xFF >> (8 - (x)))
#define NRF52_PIPE_COUNT 					  9

#define RADIO_SHORTS_COMMON ( RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_END_DISABLE_Msk | \
            RADIO_SHORTS_ADDRESS_RSSISTART_Msk | RADIO_SHORTS_DISABLED_RSSISTOP_Msk )

// Constant parameters
#define RX_WAIT_FOR_ACK_TIMEOUT_US_2MBPS      (48)        /**< 2MBit RX wait for ack timeout value. Smallest reliable value - 43 */
#define RX_WAIT_FOR_ACK_TIMEOUT_US_1MBPS      (64)        /**< 1MBit RX wait for ack timeout value. Smallest reliable value - 59 */

#define NRF52_ADDR_UPDATE_MASK_BASE0          (1 << 0)    /*< Mask value to signal updating BASE0 radio address. */
#define NRF52_ADDR_UPDATE_MASK_BASE1          (1 << 1)    /*< Mask value to signal updating BASE1 radio address. */
#define NRF52_ADDR_UPDATE_MASK_PREFIX         (1 << 2)    /*< Mask value to signal updating radio prefixes */

#define NRF52_PID_RESET_VALUE                 0xFF        /**< Invalid PID value which is guaranteed to not collide with any valid PID value. */
#define NRF52_PID_MAX                         3           /**< Maximum value for PID. */
#define NRF52_CRC_RESET_VALUE                 0xFFFF      /**< CRC reset value*/

#ifndef NRF52_RADIO_USE_TIMER0
#define NRF52_RADIO_USE_TIMER0                FALSE
#endif

#ifndef NRF52_RADIO_USE_TIMER1
#define NRF52_RADIO_USE_TIMER1                FALSE
#endif

#ifndef NRF52_RADIO_USE_TIMER2
#define NRF52_RADIO_USE_TIMER2                FALSE
#endif

#ifndef NRF52_RADIO_USE_TIMER3
#define NRF52_RADIO_USE_TIMER3                FALSE
#endif

#ifndef NRF52_RADIO_USE_TIMER4
#define NRF52_RADIO_USE_TIMER4                FALSE
#endif

#ifndef NRF52_RADIO_IRQ_PRIORITY
#define NRF52_RADIO_IRQ_PRIORITY			  3                   /**< RADIO interrupt priority. */
#endif

#ifndef NRF52_RADIO_PPI_TIMER_START
#error "PPI channel NRF52_RADIO_PPI_TIMER_START need to be defined"
#endif

#ifndef NRF52_RADIO_PPI_TIMER_STOP
#error "PPI channel NRF52_RADIO_PPI_TIMER_STOP need to be defined"
#endif

#ifndef NRF52_RADIO_PPI_RX_TIMEOUT
#error "PPI channel NRF52_RADIO_PPI_RX_TIMEOUT need to be defined"
#endif

#ifndef NRF52_RADIO_PPI_TX_START
#error "PPI channel NRF52_RADIO_PPI_TX_START need to be defined"
#endif

#if (NRF52_RADIO_USE_TIMER0 == FALSE) && (NRF52_RADIO_USE_TIMER1 == FALSE) && \
	(NRF52_RADIO_USE_TIMER2 == FALSE) && (NRF52_RADIO_USE_TIMER3 == FALSE) && \
	(NRF52_RADIO_USE_TIMER4 == FALSE)
#error "At least one hardware TIMER must be defined"
#endif

#ifndef NRF52_RADIO_INTTHD_PRIORITY
#error "Interrupt handle thread priority need to be defined"
#endif

#ifndef NRF52_RADIO_EVTTHD_PRIORITY
#error "Event thread priority need to be defined"
#endif

#define VERIFY_PAYLOAD_LENGTH(p)                            \
do                                                          \
{                                                           \
    if(p->length == 0 ||                                    \
       p->length > NRF52_MAX_PAYLOAD_LENGTH ||              \
       (RFD1.config.protocol == NRF52_PROTOCOL_ESB &&       \
        p->length > RFD1.config.payload_length))            \
    {                                                       \
        return NRF52_ERROR_INVALID_LENGTH;                  \
    }                                                       \
}while(0)

//Structure holding pipe info PID and CRC and ack payload.
typedef struct
{
    uint16_t            m_crc;
    uint8_t             m_pid;
    uint8_t             m_ack_payload;
} pipe_info_t;

// First in first out queue of payloads to be transmitted.
typedef struct
{
    nrf52_payload_t *   p_payload[NRF52_TX_FIFO_SIZE];      /**< Pointer to the actual queue. */
    uint32_t            entry_point;                        /**< Current start of queue. */
    uint32_t            exit_point;                         /**< Current end of queue. */
    uint32_t            count;                              /**< Current number of elements in the queue. */
} nrf52_payload_tx_fifo_t;

// First in first out queue of received payloads.
typedef struct
{
    nrf52_payload_t *   p_payload[NRF52_RX_FIFO_SIZE];      /**< Pointer to the actual queue. */
    uint32_t            entry_point;                        /**< Current start of queue. */
    uint32_t            exit_point;                         /**< Current end of queue. */
    uint32_t            count;                              /**< Current number of elements in the queue. */
} nrf52_payload_rx_fifo_t;

// These function pointers are changed dynamically, depending on protocol configuration and state.
//static void (*on_radio_end)(RFDriver *rfp) = NULL;
static void (*set_rf_payload_format)(RFDriver *rfp, uint32_t payload_length) = NULL;

// The following functions are assigned to the function pointers above.
static void on_radio_disabled_tx_noack(RFDriver *rfp);
static void on_radio_disabled_tx(RFDriver *rfp);
static void on_radio_disabled_tx_wait_for_ack(RFDriver *rfp);
static void on_radio_disabled_rx(RFDriver *rfp);
static void on_radio_disabled_rx_ack(RFDriver *rfp);

static volatile uint16_t wait_for_ack_timeout_us;
static nrf52_payload_t * p_current_payload;

// TX FIFO
static nrf52_payload_t            tx_fifo_payload[NRF52_TX_FIFO_SIZE];
static nrf52_payload_tx_fifo_t    tx_fifo;

// RX FIFO
static nrf52_payload_t            rx_fifo_payload[NRF52_RX_FIFO_SIZE];
static nrf52_payload_rx_fifo_t    rx_fifo;

