iNavFlight/inav/lib/main/ChibiOS/community/testhal/NRF52/NRF52832/RADIO-ESB/nrf52_radio.c
// Payload buffers
static uint8_t                    tx_payload_buffer[NRF52_MAX_PAYLOAD_LENGTH + 2];
static uint8_t                    rx_payload_buffer[NRF52_MAX_PAYLOAD_LENGTH + 2];

static uint8_t                    pids[NRF52_PIPE_COUNT];
static pipe_info_t                rx_pipe_info[NRF52_PIPE_COUNT];

 // disable and events semaphores.
static binary_semaphore_t disable_sem;
static binary_semaphore_t events_sem;

RFDriver RFD1;

// Function to do bytewise bit-swap on a unsigned 32 bit value
static uint32_t bytewise_bit_swap(uint8_t const * p_inp) {
    uint32_t inp = (*(uint32_t*)p_inp);

    return __REV((uint32_t)__RBIT(inp)); //lint -esym(628, __rev) -esym(526, __rev) -esym(628, __rbit) -esym(526, __rbit) */
}

// Internal function to convert base addresses from nRF24L type addressing to nRF52 type addressing
static uint32_t addr_conv(uint8_t const* p_addr) {
    return __REV(bytewise_bit_swap(p_addr)); //lint -esym(628, __rev) -esym(526, __rev) */
}

static thread_t *rfEvtThread_p;
static THD_WORKING_AREA(waRFEvtThread, 64);
static THD_FUNCTION(rfEvtThread, arg) {
    (void)arg;

    chRegSetThreadName("rfevent");

    while (!chThdShouldTerminateX()) {
    	chBSemWait(&events_sem);

    	nrf52_int_flags_t interrupts = RFD1.flags;
        RFD1.flags = 0;

        if (interrupts & NRF52_INT_TX_SUCCESS_MSK) {
            chEvtBroadcastFlags(&RFD1.eventsrc, (eventflags_t) NRF52_EVENT_TX_SUCCESS);
        }
        if (interrupts & NRF52_INT_TX_FAILED_MSK) {
        	chEvtBroadcastFlags(&RFD1.eventsrc, (eventflags_t) NRF52_EVENT_TX_FAILED);
        }
        if (interrupts & NRF52_INT_RX_DR_MSK) {
        	chEvtBroadcastFlags(&RFD1.eventsrc, (eventflags_t) NRF52_EVENT_RX_RECEIVED);
        }
    }
    chThdExit((msg_t) 0);
}

static thread_t *rfIntThread_p;
static THD_WORKING_AREA(waRFIntThread, 64);
static THD_FUNCTION(rfIntThread, arg) {
    (void)arg;

    chRegSetThreadName("rfint");

    while (!chThdShouldTerminateX()) {
    	chBSemWait(&disable_sem);
    	switch (RFD1.state) {
    	  case NRF52_STATE_PTX_TX:
    		  on_radio_disabled_tx_noack(&RFD1);
    		  break;
    	  case NRF52_STATE_PTX_TX_ACK:
    		  on_radio_disabled_tx(&RFD1);
    		  break;
    	  case NRF52_STATE_PTX_RX_ACK:
    		  on_radio_disabled_tx_wait_for_ack(&RFD1);
    		  break;
    	  case NRF52_STATE_PRX:
    		  on_radio_disabled_rx(&RFD1);
    		  break;
    	  case NRF52_STATE_PRX_SEND_ACK:
    		  on_radio_disabled_rx_ack(&RFD1);
    		  break;
    	  default:
    		  break;
    	}
    }
	chThdExit((msg_t) 0);
}

static void serve_radio_interrupt(RFDriver *rfp) {
	(void) rfp;
    if ((NRF_RADIO->INTENSET & RADIO_INTENSET_READY_Msk) && NRF_RADIO->EVENTS_READY) {
        NRF_RADIO->EVENTS_READY = 0;
        (void) NRF_RADIO->EVENTS_READY;
    }
    if ((NRF_RADIO->INTENSET & RADIO_INTENSET_DISABLED_Msk) && NRF_RADIO->EVENTS_DISABLED) {
        NRF_RADIO->EVENTS_DISABLED = 0;
        (void) NRF_RADIO->EVENTS_DISABLED;
        chSysLockFromISR();
       	chBSemSignalI(&disable_sem);
       	chSysUnlockFromISR();
    }
}

/**
 * @brief   RADIO events interrupt handler.
 *
 * @isr
 */
OSAL_IRQ_HANDLER(Vector44) {

  OSAL_IRQ_PROLOGUE();

  serve_radio_interrupt(&RFD1);

  OSAL_IRQ_EPILOGUE();
}

static void set_rf_payload_format_esb_dpl(RFDriver *rfp, uint32_t payload_length) {
	(void)payload_length;
#if (NRF52_MAX_PAYLOAD_LENGTH <= 32)
    // Using 6 bits for length
    NRF_RADIO->PCNF0 = (0 << RADIO_PCNF0_S0LEN_Pos) |
                       (6 << RADIO_PCNF0_LFLEN_Pos) |
                       (3 << RADIO_PCNF0_S1LEN_Pos) ;
#else
    // Using 8 bits for length
    NRF_RADIO->PCNF0 = (0 << RADIO_PCNF0_S0LEN_Pos) |
                       (8 << RADIO_PCNF0_LFLEN_Pos) |
                       (3 << RADIO_PCNF0_S1LEN_Pos) ;
#endif
    NRF_RADIO->PCNF1 = (RADIO_PCNF1_WHITEEN_Disabled    << RADIO_PCNF1_WHITEEN_Pos) |
                       (RADIO_PCNF1_ENDIAN_Big          << RADIO_PCNF1_ENDIAN_Pos)  |
                       ((rfp->config.address.addr_length - 1)  << RADIO_PCNF1_BALEN_Pos)   |
                       (0                               << RADIO_PCNF1_STATLEN_Pos) |
                       (NRF52_MAX_PAYLOAD_LENGTH        << RADIO_PCNF1_MAXLEN_Pos);
}

static void set_rf_payload_format_esb(RFDriver *rfp, uint32_t payload_length) {
    NRF_RADIO->PCNF0 = (1 << RADIO_PCNF0_S0LEN_Pos) |
                       (0 << RADIO_PCNF0_LFLEN_Pos) |
                       (1 << RADIO_PCNF0_S1LEN_Pos);

    NRF_RADIO->PCNF1 = (RADIO_PCNF1_WHITEEN_Disabled    << RADIO_PCNF1_WHITEEN_Pos) |
                       (RADIO_PCNF1_ENDIAN_Big          << RADIO_PCNF1_ENDIAN_Pos)  |
                       ((rfp->config.address.addr_length - 1)  << RADIO_PCNF1_BALEN_Pos)   |
                       (payload_length                  << RADIO_PCNF1_STATLEN_Pos) |
                       (payload_length                  << RADIO_PCNF1_MAXLEN_Pos);
}

/* Set BASE0 and BASE1 addresses & prefixes registers
 *   NRF52 { prefixes[0], base0_addr[0], base0_addr[1], base0_addr[2], base0_addr[3] } ==
 *   NRF24 { addr[0], addr[1], addr[2], addr[3], addr[4] }
 */
static void set_addresses(RFDriver *rfp, uint8_t update_mask) {
    if (update_mask & NRF52_ADDR_UPDATE_MASK_BASE0) {
        NRF_RADIO->BASE0 = addr_conv(rfp->config.address.base_addr_p0);
        NRF_RADIO->DAB[0] = addr_conv(rfp->config.address.base_addr_p0);
    }

    if (update_mask & NRF52_ADDR_UPDATE_MASK_BASE1) {
        NRF_RADIO->BASE1 = addr_conv(rfp->config.address.base_addr_p1);
        NRF_RADIO->DAB[1] = addr_conv(rfp->config.address.base_addr_p1);
    }

    if (update_mask & NRF52_ADDR_UPDATE_MASK_PREFIX) {
        NRF_RADIO->PREFIX0 = bytewise_bit_swap(&rfp->config.address.pipe_prefixes[0]);
        NRF_RADIO->DAP[0] = bytewise_bit_swap(&rfp->config.address.pipe_prefixes[0]);
        NRF_RADIO->PREFIX1 = bytewise_bit_swap(&rfp->config.address.pipe_prefixes[4]);
        NRF_RADIO->DAP[1] = bytewise_bit_swap(&rfp->config.address.pipe_prefixes[4]);
    }
}

static void set_tx_power(RFDriver *rfp) {
    NRF_RADIO->TXPOWER = rfp->config.tx_power << RADIO_TXPOWER_TXPOWER_Pos;
}

static void set_bitrate(RFDriver *rfp) {
    NRF_RADIO->MODE = rfp->config.bitrate << RADIO_MODE_MODE_Pos;

