iNavFlight/inav/lib/main/ChibiOS/community/testhal/NRF52/NRF52832/RADIO-ESB/nrf52_radio.c
    switch (rfp->config.bitrate) {
        case NRF52_BITRATE_2MBPS:
            wait_for_ack_timeout_us = RX_WAIT_FOR_ACK_TIMEOUT_US_2MBPS;
            break;
        case NRF52_BITRATE_1MBPS:
            wait_for_ack_timeout_us = RX_WAIT_FOR_ACK_TIMEOUT_US_1MBPS;
            break;
    }
}

static void set_protocol(RFDriver *rfp) {
    switch (rfp->config.protocol) {
        case NRF52_PROTOCOL_ESB_DPL:
            set_rf_payload_format = set_rf_payload_format_esb_dpl;
            break;
        case NRF52_PROTOCOL_ESB:
            set_rf_payload_format = set_rf_payload_format_esb;
            break;
    }
}

static void set_crc(RFDriver *rfp) {
    NRF_RADIO->CRCCNF = rfp->config.crc << RADIO_CRCCNF_LEN_Pos;

    if (rfp->config.crc == RADIO_CRCCNF_LEN_Two)
    {
        NRF_RADIO->CRCINIT = 0xFFFFUL;      // Initial value
        NRF_RADIO->CRCPOLY = 0x11021UL;     // CRC poly: x^16+x^12^x^5+1
    }
    else if (rfp->config.crc == RADIO_CRCCNF_LEN_One)
    {
        NRF_RADIO->CRCINIT = 0xFFUL;        // Initial value
        NRF_RADIO->CRCPOLY = 0x107UL;       // CRC poly: x^8+x^2^x^1+1
    }
}

static void ppi_init(RFDriver *rfp) {
    NRF_PPI->CH[NRF52_RADIO_PPI_TIMER_START].EEP = (uint32_t)&NRF_RADIO->EVENTS_READY;
    NRF_PPI->CH[NRF52_RADIO_PPI_TIMER_START].TEP = (uint32_t)&rfp->timer->TASKS_START;

    NRF_PPI->CH[NRF52_RADIO_PPI_TIMER_STOP].EEP  = (uint32_t)&NRF_RADIO->EVENTS_ADDRESS;
    NRF_PPI->CH[NRF52_RADIO_PPI_TIMER_STOP].TEP  = (uint32_t)&rfp->timer->TASKS_STOP;

    NRF_PPI->CH[NRF52_RADIO_PPI_RX_TIMEOUT].EEP  = (uint32_t)&rfp->timer->EVENTS_COMPARE[0];
    NRF_PPI->CH[NRF52_RADIO_PPI_RX_TIMEOUT].TEP  = (uint32_t)&NRF_RADIO->TASKS_DISABLE;

    NRF_PPI->CH[NRF52_RADIO_PPI_TX_START].EEP    = (uint32_t)&rfp->timer->EVENTS_COMPARE[1];
    NRF_PPI->CH[NRF52_RADIO_PPI_TX_START].TEP    = (uint32_t)&NRF_RADIO->TASKS_TXEN;
}

static void set_parameters(RFDriver *rfp) {
    set_tx_power(rfp);
    set_bitrate(rfp);
    set_protocol(rfp);
    set_crc(rfp);
    set_rf_payload_format(rfp, rfp->config.payload_length);
}

static void reset_fifo(void) {
    tx_fifo.entry_point = 0;
    tx_fifo.exit_point  = 0;
    tx_fifo.count       = 0;

    rx_fifo.entry_point = 0;
    rx_fifo.exit_point  = 0;
    rx_fifo.count       = 0;
}

static void init_fifo(void) {
	uint8_t i;
    reset_fifo();

    for (i = 0; i < NRF52_TX_FIFO_SIZE; i++) {
        tx_fifo.p_payload[i] = &tx_fifo_payload[i];
    }

    for (i = 0; i < NRF52_RX_FIFO_SIZE; i++) {
        rx_fifo.p_payload[i] = &rx_fifo_payload[i];
    }
}

static void tx_fifo_remove_last(void) {
    if (tx_fifo.count > 0) {
        nvicDisableVector(RADIO_IRQn);

        tx_fifo.count--;
        if (++tx_fifo.exit_point >= NRF52_TX_FIFO_SIZE) {
            tx_fifo.exit_point = 0;
        }

        nvicEnableVector(RADIO_IRQn, NRF52_RADIO_IRQ_PRIORITY);
    }
}

/** @brief  Function to push the content of the rx_buffer to the RX FIFO.
 *
 *  The module will point the register NRF_RADIO->PACKETPTR to a buffer for receiving packets.
 *  After receiving a packet the module will call this function to copy the received data to
 *  the RX FIFO.
 *
 *  @param  pipe Pipe number to set for the packet.
 *  @param  pid  Packet ID.
 *
 *  @retval true   Operation successful.
 *  @retval false  Operation failed.
 */
static bool rx_fifo_push_rfbuf(RFDriver *rfp, uint8_t pipe, uint8_t pid) {
    if (rx_fifo.count < NRF52_RX_FIFO_SIZE) {
        if (rfp->config.protocol == NRF52_PROTOCOL_ESB_DPL) {
            if (rx_payload_buffer[0] > NRF52_MAX_PAYLOAD_LENGTH) {
                return false;
            }

            rx_fifo.p_payload[rx_fifo.entry_point]->length = rx_payload_buffer[0];
        }
        else if (rfp->state == NRF52_STATE_PTX_RX_ACK) {
            // Received packet is an acknowledgment
            rx_fifo.p_payload[rx_fifo.entry_point]->length = 0;
        }
        else {
            rx_fifo.p_payload[rx_fifo.entry_point]->length = rfp->config.payload_length;
        }

        memcpy(rx_fifo.p_payload[rx_fifo.entry_point]->data, &rx_payload_buffer[2],
               rx_fifo.p_payload[rx_fifo.entry_point]->length);

        rx_fifo.p_payload[rx_fifo.entry_point]->pipe = pipe;
        rx_fifo.p_payload[rx_fifo.entry_point]->rssi = NRF_RADIO->RSSISAMPLE;
        rx_fifo.p_payload[rx_fifo.entry_point]->pid = pid;
        if (++rx_fifo.entry_point >= NRF52_RX_FIFO_SIZE) {
            rx_fifo.entry_point = 0;
        }
        rx_fifo.count++;

        return true;
    }

    return false;
}

static void timer_init(RFDriver *rfp) {
    // Configure the system timer with a 1 MHz base frequency
    rfp->timer->PRESCALER = 4;
    rfp->timer->BITMODE   = TIMER_BITMODE_BITMODE_16Bit;
    rfp->timer->SHORTS    = TIMER_SHORTS_COMPARE1_CLEAR_Msk | TIMER_SHORTS_COMPARE1_STOP_Msk;
}

static void start_tx_transaction(RFDriver *rfp) {
    bool ack;

    rfp->tx_attempt = 1;
    rfp->tx_remaining = rfp->config.retransmit.count;

    // Prepare the payload
    p_current_payload = tx_fifo.p_payload[tx_fifo.exit_point];

    // Handling ack if noack is set to false or if selctive auto ack is turned turned off
    ack = !p_current_payload->noack || !rfp->config.selective_auto_ack;

    switch (rfp->config.protocol) {
        case NRF52_PROTOCOL_ESB:
            set_rf_payload_format(rfp, p_current_payload->length);
            tx_payload_buffer[0] = p_current_payload->pid;
            tx_payload_buffer[1] = 0;
            memcpy(&tx_payload_buffer[2], p_current_payload->data, p_current_payload->length);

            NRF_RADIO->SHORTS   = RADIO_SHORTS_COMMON | RADIO_SHORTS_DISABLED_RXEN_Msk;
            NRF_RADIO->INTENSET = RADIO_INTENSET_DISABLED_Msk | RADIO_INTENSET_READY_Msk;

            // Configure the retransmit counter
            rfp->tx_remaining = rfp->config.retransmit.count;
            rfp->state = NRF52_STATE_PTX_TX_ACK;
            break;

        case NRF52_PROTOCOL_ESB_DPL:
            tx_payload_buffer[0] = p_current_payload->length;
            tx_payload_buffer[1] = p_current_payload->pid << 1;
            tx_payload_buffer[1] |= ack ? 0x00 : 0x01;
            memcpy(&tx_payload_buffer[2], p_current_payload->data, p_current_payload->length);

            if (ack) {
                NRF_RADIO->SHORTS   = RADIO_SHORTS_COMMON | RADIO_SHORTS_DISABLED_RXEN_Msk;
                NRF_RADIO->INTENSET = RADIO_INTENSET_DISABLED_Msk | RADIO_INTENSET_READY_Msk;

