iNavFlight/inav/lib/main/ChibiOS/community/testhal/NRF52/NRF52832/RADIO-ESB/nrf52_radio.c
                // Configure the retransmit counter
                rfp->tx_remaining = rfp->config.retransmit.count;
                rfp->state = NRF52_STATE_PTX_TX_ACK;
            }
            else {
                NRF_RADIO->SHORTS   = RADIO_SHORTS_COMMON;
                NRF_RADIO->INTENSET = RADIO_INTENSET_DISABLED_Msk;
                rfp->state = NRF52_STATE_PTX_TX;
            }
            break;
    }

    NRF_RADIO->TXADDRESS    = p_current_payload->pipe;
    NRF_RADIO->RXADDRESSES  = 1 << p_current_payload->pipe;

    NRF_RADIO->FREQUENCY    = rfp->config.address.rf_channel;
    NRF_RADIO->PACKETPTR    = (uint32_t)tx_payload_buffer;

    NRF_RADIO->EVENTS_READY = 0;
    NRF_RADIO->EVENTS_DISABLED = 0;
    (void)NRF_RADIO->EVENTS_READY;
    (void)NRF_RADIO->EVENTS_DISABLED;

    nvicClearPending(RADIO_IRQn);
    nvicEnableVector(RADIO_IRQn, NRF52_RADIO_IRQ_PRIORITY);

    NRF_RADIO->TASKS_TXEN  = 1;
}

static void on_radio_disabled_tx_noack(RFDriver *rfp) {
    rfp->flags |= NRF52_INT_TX_SUCCESS_MSK;
    tx_fifo_remove_last();

	chBSemSignal(&events_sem);

	if (tx_fifo.count == 0) {
        rfp->state = NRF52_STATE_IDLE;
    }
    else {
        start_tx_transaction(rfp);
    }
}

static void on_radio_disabled_tx(RFDriver *rfp) {
    // Remove the DISABLED -> RXEN shortcut, to make sure the radio stays
    // disabled after the RX window
    NRF_RADIO->SHORTS = RADIO_SHORTS_COMMON;

    // Make sure the timer is started the next time the radio is ready,
    // and that it will disable the radio automatically if no packet is
    // received by the time defined in m_wait_for_ack_timeout_us
    rfp->timer->CC[0]    = wait_for_ack_timeout_us + 130;
    rfp->timer->CC[1]    = rfp->config.retransmit.delay - 130;
    rfp->timer->TASKS_CLEAR = 1;
    rfp->timer->EVENTS_COMPARE[0] = 0;
    rfp->timer->EVENTS_COMPARE[1] = 0;
    (void)rfp->timer->EVENTS_COMPARE[0];
    (void)rfp->timer->EVENTS_COMPARE[1];

    NRF_PPI->CHENSET = (1 << NRF52_RADIO_PPI_TIMER_START) |
                       (1 << NRF52_RADIO_PPI_RX_TIMEOUT) |
                       (1 << NRF52_RADIO_PPI_TIMER_STOP);
    NRF_PPI->CHENCLR = (1 << NRF52_RADIO_PPI_TX_START);

    NRF_RADIO->EVENTS_END = 0;
    (void)NRF_RADIO->EVENTS_END;

    if (rfp->config.protocol == NRF52_PROTOCOL_ESB) {
        set_rf_payload_format(rfp, 0);
    }

    NRF_RADIO->PACKETPTR = (uint32_t)rx_payload_buffer;
    rfp->state = NRF52_STATE_PTX_RX_ACK;
}

static void on_radio_disabled_tx_wait_for_ack(RFDriver *rfp) {
    // This marks the completion of a TX_RX sequence (TX with ACK)

    // Make sure the timer will not deactivate the radio if a packet is received
    NRF_PPI->CHENCLR = (1 << NRF52_RADIO_PPI_TIMER_START) |
                       (1 << NRF52_RADIO_PPI_RX_TIMEOUT)  |
                       (1 << NRF52_RADIO_PPI_TIMER_STOP);

    // If the radio has received a packet and the CRC status is OK
    if (NRF_RADIO->EVENTS_END && NRF_RADIO->CRCSTATUS != 0) {
        rfp->timer->TASKS_STOP = 1;
        NRF_PPI->CHENCLR = (1 << NRF52_RADIO_PPI_TX_START);
        rfp->flags |= NRF52_INT_TX_SUCCESS_MSK;
        rfp->tx_attempt++;// = rfp->config.retransmit.count - rfp->tx_remaining + 1;

        tx_fifo_remove_last();

        if (rfp->config.protocol != NRF52_PROTOCOL_ESB && rx_payload_buffer[0] > 0) {
            if (rx_fifo_push_rfbuf(rfp, (uint8_t)NRF_RADIO->TXADDRESS, 0)) {
                rfp->flags |= NRF52_INT_RX_DR_MSK;
            }
        }

    	chBSemSignal(&events_sem);

        if ((tx_fifo.count == 0) || (rfp->config.tx_mode == NRF52_TXMODE_MANUAL)) {
            rfp->state = NRF52_STATE_IDLE;
        }
        else {
            start_tx_transaction(rfp);
        }
    }
    else {
        if (rfp->tx_remaining-- == 0) {
            rfp->timer->TASKS_STOP = 1;
            NRF_PPI->CHENCLR = (1 << NRF52_RADIO_PPI_TX_START);
            // All retransmits are expended, and the TX operation is suspended
            rfp->tx_attempt = rfp->config.retransmit.count + 1;
            rfp->flags |= NRF52_INT_TX_FAILED_MSK;

            chBSemSignal(&events_sem);

            rfp->state = NRF52_STATE_IDLE;
        }
        else {
            // There are still have more retransmits left, TX mode should be
            // entered again as soon as the system timer reaches CC[1].
            NRF_RADIO->SHORTS = RADIO_SHORTS_COMMON | RADIO_SHORTS_DISABLED_RXEN_Msk;
            set_rf_payload_format(rfp, p_current_payload->length);
            NRF_RADIO->PACKETPTR = (uint32_t)tx_payload_buffer;
            rfp->state = NRF52_STATE_PTX_TX_ACK;
            rfp->timer->TASKS_START = 1;
            NRF_PPI->CHENSET = (1 << NRF52_RADIO_PPI_TX_START);
            if (rfp->timer->EVENTS_COMPARE[1])
                NRF_RADIO->TASKS_TXEN = 1;
        }
    }
}

static void clear_events_restart_rx(RFDriver *rfp) {
    NRF_RADIO->SHORTS = RADIO_SHORTS_COMMON;
    set_rf_payload_format(rfp, rfp->config.payload_length);
    NRF_RADIO->PACKETPTR = (uint32_t)rx_payload_buffer;

    NRF_RADIO->INTENCLR = RADIO_INTENCLR_DISABLED_Msk;
    NRF_RADIO->EVENTS_DISABLED = 0;
    (void) NRF_RADIO->EVENTS_DISABLED;

    NRF_RADIO->TASKS_DISABLE = 1;
    while (NRF_RADIO->EVENTS_DISABLED == 0);

    NRF_RADIO->EVENTS_DISABLED = 0;
    (void) NRF_RADIO->EVENTS_DISABLED;
    NRF_RADIO->INTENSET = RADIO_INTENSET_DISABLED_Msk;

    NRF_RADIO->SHORTS = RADIO_SHORTS_COMMON | RADIO_SHORTS_DISABLED_TXEN_Msk;
    NRF_RADIO->TASKS_RXEN = 1;
}

static void on_radio_disabled_rx(RFDriver *rfp) {
    bool            ack                = false;
    bool            retransmit_payload = false;
    bool            send_rx_event      = true;
    pipe_info_t *   p_pipe_info;

    if (NRF_RADIO->CRCSTATUS == 0) {
        clear_events_restart_rx(rfp);
        return;
    }

    if(rx_fifo.count >= NRF52_RX_FIFO_SIZE) {
        clear_events_restart_rx(rfp);
        return;
    }

    p_pipe_info = &rx_pipe_info[NRF_RADIO->RXMATCH];
    if (NRF_RADIO->RXCRC           == p_pipe_info->m_crc &&
       (rx_payload_buffer[1] >> 1) == p_pipe_info->m_pid  ) {
        retransmit_payload = true;
        send_rx_event = false;
    }

