iNavFlight/inav/lib/main/ChibiOS/community/testhal/NRF52/NRF52832/RADIO-ESB/nrf52_radio.c
    p_pipe_info->m_pid = rx_payload_buffer[1] >> 1;
    p_pipe_info->m_crc = NRF_RADIO->RXCRC;

    if(rfp->config.selective_auto_ack == false || ((rx_payload_buffer[1] & 0x01) == 0))
        ack = true;

    if(ack) {
        NRF_RADIO->SHORTS = RADIO_SHORTS_COMMON | RADIO_SHORTS_DISABLED_RXEN_Msk;

        switch(rfp->config.protocol) {
            case NRF52_PROTOCOL_ESB_DPL:
                {
                    if (tx_fifo.count > 0 &&
                        (tx_fifo.p_payload[tx_fifo.exit_point]->pipe == NRF_RADIO->RXMATCH))
                    {
                        // Pipe stays in ACK with payload until TX fifo is empty
                        // Do not report TX success on first ack payload or retransmit
                        if (p_pipe_info->m_ack_payload != 0 && !retransmit_payload) {
                            if(++tx_fifo.exit_point >= NRF52_TX_FIFO_SIZE) {
                                tx_fifo.exit_point = 0;
                            }

                            tx_fifo.count--;

                            // ACK payloads also require TX_DS
                            // (page 40 of the 'nRF24LE1_Product_Specification_rev1_6.pdf').
                            rfp->flags |= NRF52_INT_TX_SUCCESS_MSK;
                        }

                        p_pipe_info->m_ack_payload = 1;

                        p_current_payload = tx_fifo.p_payload[tx_fifo.exit_point];

                        set_rf_payload_format(rfp, p_current_payload->length);
                        tx_payload_buffer[0] = p_current_payload->length;
                        memcpy(&tx_payload_buffer[2],
                               p_current_payload->data,
                               p_current_payload->length);
                    }
                    else {
                        p_pipe_info->m_ack_payload = 0;
                        set_rf_payload_format(rfp, 0);
                        tx_payload_buffer[0] = 0;
                    }

                    tx_payload_buffer[1] = rx_payload_buffer[1];
                }
                break;

            case NRF52_PROTOCOL_ESB:
                {
                    set_rf_payload_format(rfp, 0);
                    tx_payload_buffer[0] = rx_payload_buffer[0];
                    tx_payload_buffer[1] = 0;
                }
                break;
        }

        rfp->state = NRF52_STATE_PRX_SEND_ACK;
        NRF_RADIO->TXADDRESS = NRF_RADIO->RXMATCH;
        NRF_RADIO->PACKETPTR = (uint32_t)tx_payload_buffer;
    }
    else {
        clear_events_restart_rx(rfp);
    }

    if (send_rx_event) {
        // Push the new packet to the RX buffer and trigger a received event if the operation was
        // successful.
        if (rx_fifo_push_rfbuf(rfp, NRF_RADIO->RXMATCH, p_pipe_info->m_pid)) {
            rfp->flags |= NRF52_INT_RX_DR_MSK;
            chBSemSignal(&events_sem);
        }
    }
}

static void on_radio_disabled_rx_ack(RFDriver *rfp) {
    NRF_RADIO->SHORTS = RADIO_SHORTS_COMMON | RADIO_SHORTS_DISABLED_TXEN_Msk;
    set_rf_payload_format(rfp, rfp->config.payload_length);

    NRF_RADIO->PACKETPTR = (uint32_t)rx_payload_buffer;

    rfp->state = NRF52_STATE_PRX;
}

nrf52_error_t radio_disable(void) {
    RFD1.state = NRF52_STATE_IDLE;

    // Clear PPI
    NRF_PPI->CHENCLR = (1 << NRF52_RADIO_PPI_TIMER_START) |
                       (1 << NRF52_RADIO_PPI_TIMER_STOP)  |
                       (1 << NRF52_RADIO_PPI_RX_TIMEOUT);

    reset_fifo();

    memset(rx_pipe_info, 0, sizeof(rx_pipe_info));
    memset(pids, 0, sizeof(pids));

    // Disable the radio
    NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Enabled << RADIO_SHORTS_READY_START_Pos |
                        RADIO_SHORTS_END_DISABLE_Enabled << RADIO_SHORTS_END_DISABLE_Pos;

    nvicDisableVector(RADIO_IRQn);

    // Terminate interrupts handle thread
    chThdTerminate(rfIntThread_p);
    chBSemSignal(&disable_sem);
    chThdWait(rfIntThread_p);

    // Terminate events handle thread
    chThdTerminate(rfEvtThread_p);
    RFD1.flags = 0;
    chBSemSignal(&events_sem);
    chThdWait(rfEvtThread_p);

    RFD1.state = NRF52_STATE_UNINIT;

    return NRF52_SUCCESS;
}

//
nrf52_error_t radio_init(nrf52_config_t const *config) {
	osalDbgAssert(config != NULL,
		"config must be defined");
	osalDbgAssert(&config->address != NULL,
		"address must be defined");
	osalDbgAssert(NRF52_RADIO_IRQ_PRIORITY <= 7,
		"wrong radio irq priority");

    if (RFD1.state != NRF52_STATE_UNINIT) {
    	nrf52_error_t err = radio_disable();
        if (err != NRF52_SUCCESS)
            return err;
    }

    RFD1.radio = NRF_RADIO;
	RFD1.config = *config;
    RFD1.flags    = 0;

    init_fifo();

#if NRF52_RADIO_USE_TIMER0
    RFD1.timer = NRF_TIMER0;
#endif
#if NRF52_RADIO_USE_TIMER1
    RFD1.timer = NRF_TIMER1;
#endif
#if NRF52_RADIO_USE_TIMER2
    RFD1.timer = NRF_TIMER2;
#endif
#if NRF52_RADIO_USE_TIMER3
    RFD1.timer = NRF_TIMER3;
#endif
#if NRF52_RADIO_USE_TIMER4
    RFD1.timer = NRF_TIMER4;
#endif

    set_parameters(&RFD1);

    set_addresses(&RFD1, NRF52_ADDR_UPDATE_MASK_BASE0);
    set_addresses(&RFD1, NRF52_ADDR_UPDATE_MASK_BASE1);
    set_addresses(&RFD1, NRF52_ADDR_UPDATE_MASK_PREFIX);

    ppi_init(&RFD1);
    timer_init(&RFD1);

    chBSemObjectInit(&disable_sem, TRUE);
    chBSemObjectInit(&events_sem, TRUE);

    chEvtObjectInit(&RFD1.eventsrc);

    // interrupt handle thread
    rfIntThread_p = chThdCreateStatic(waRFIntThread, sizeof(waRFIntThread),
    		NRF52_RADIO_INTTHD_PRIORITY, rfIntThread, NULL);

    // events handle thread
    rfEvtThread_p = chThdCreateStatic(waRFEvtThread, sizeof(waRFEvtThread),
    		NRF52_RADIO_EVTTHD_PRIORITY, rfEvtThread, NULL);

    nvicEnableVector(RADIO_IRQn, NRF52_RADIO_IRQ_PRIORITY);

    RFD1.state = NRF52_STATE_IDLE;

    return NRF52_SUCCESS;
}

nrf52_error_t radio_write_payload(nrf52_payload_t const * p_payload) {
    if (RFD1.state == NRF52_STATE_UNINIT)
    	return NRF52_INVALID_STATE;
    if(p_payload == NULL)
    	return NRF52_ERROR_NULL;
    VERIFY_PAYLOAD_LENGTH(p_payload);
    if (tx_fifo.count >= NRF52_TX_FIFO_SIZE)
    	return NRF52_ERROR_INVALID_LENGTH;

