iNavFlight/inav/lib/main/ChibiOS/community/testhal/NRF52/NRF52832/RADIO-ESB/nrf52_radio.c
    if (RFD1.config.mode == NRF52_MODE_PTX &&
        p_payload->noack && !RFD1.config.selective_auto_ack )
    {
        return NRF52_ERROR_NOT_SUPPORTED;
    }

    nvicDisableVector(RADIO_IRQn);

    memcpy(tx_fifo.p_payload[tx_fifo.entry_point], p_payload, sizeof(nrf52_payload_t));

    pids[p_payload->pipe] = (pids[p_payload->pipe] + 1) % (NRF52_PID_MAX + 1);
    tx_fifo.p_payload[tx_fifo.entry_point]->pid = pids[p_payload->pipe];

    if (++tx_fifo.entry_point >= NRF52_TX_FIFO_SIZE) {
        tx_fifo.entry_point = 0;
    }

    tx_fifo.count++;

    nvicEnableVector(RADIO_IRQn, NRF52_RADIO_IRQ_PRIORITY);

    if (RFD1.config.mode == NRF52_MODE_PTX &&
        RFD1.config.tx_mode == NRF52_TXMODE_AUTO &&
        RFD1.state == NRF52_STATE_IDLE)
    {
        start_tx_transaction(&RFD1);
    }

    return NRF52_SUCCESS;
}

nrf52_error_t radio_read_rx_payload(nrf52_payload_t * p_payload) {
    if (RFD1.state == NRF52_STATE_UNINIT)
    	return NRF52_INVALID_STATE;
    if (p_payload == NULL)
    	return NRF52_ERROR_NULL;

    if (rx_fifo.count == 0) {
        return NRF52_ERROR_INVALID_LENGTH;
    }

    nvicDisableVector(RADIO_IRQn);

    p_payload->length = rx_fifo.p_payload[rx_fifo.exit_point]->length;
    p_payload->pipe   = rx_fifo.p_payload[rx_fifo.exit_point]->pipe;
    p_payload->rssi   = rx_fifo.p_payload[rx_fifo.exit_point]->rssi;
    p_payload->pid    = rx_fifo.p_payload[rx_fifo.exit_point]->pid;
    memcpy(p_payload->data, rx_fifo.p_payload[rx_fifo.exit_point]->data, p_payload->length);

    if (++rx_fifo.exit_point >= NRF52_RX_FIFO_SIZE) {
        rx_fifo.exit_point = 0;
    }

    rx_fifo.count--;

    nvicEnableVector(RADIO_IRQn, NRF52_RADIO_IRQ_PRIORITY);

    return NRF52_SUCCESS;
}

nrf52_error_t radio_start_tx(void) {
    if (RFD1.state != NRF52_STATE_IDLE)
    	return NRF52_ERROR_BUSY;

    if (tx_fifo.count == 0) {
        return NRF52_ERROR_INVALID_LENGTH;
    }

    start_tx_transaction(&RFD1);

    return NRF52_SUCCESS;
}

nrf52_error_t radio_start_rx(void) {
    if (RFD1.state != NRF52_STATE_IDLE)
    	return NRF52_ERROR_BUSY;

    NRF_RADIO->INTENCLR = 0xFFFFFFFF;
    NRF_RADIO->EVENTS_DISABLED = 0;
    (void) NRF_RADIO->EVENTS_DISABLED;

    NRF_RADIO->SHORTS      = RADIO_SHORTS_COMMON | RADIO_SHORTS_DISABLED_TXEN_Msk;
    NRF_RADIO->INTENSET    = RADIO_INTENSET_DISABLED_Msk;
    RFD1.state             = NRF52_STATE_PRX;

    NRF_RADIO->RXADDRESSES  = RFD1.config.address.rx_pipes;
    NRF_RADIO->FREQUENCY    = RFD1.config.address.rf_channel;
    NRF_RADIO->PACKETPTR    = (uint32_t)rx_payload_buffer;

    nvicClearPending(RADIO_IRQn);
    nvicEnableVector(RADIO_IRQn, NRF52_RADIO_IRQ_PRIORITY);

    NRF_RADIO->EVENTS_ADDRESS = 0;
    NRF_RADIO->EVENTS_PAYLOAD = 0;
    NRF_RADIO->EVENTS_DISABLED = 0;
    (void) NRF_RADIO->EVENTS_ADDRESS;
    (void) NRF_RADIO->EVENTS_PAYLOAD;
    (void) NRF_RADIO->EVENTS_DISABLED;

    NRF_RADIO->TASKS_RXEN  = 1;

    return NRF52_SUCCESS;
}

nrf52_error_t radio_stop_rx(void) {
    if (RFD1.state != NRF52_STATE_PRX) {
        return NRF52_INVALID_STATE;
    }

    NRF_RADIO->SHORTS = 0;
    NRF_RADIO->INTENCLR = 0xFFFFFFFF;
    NRF_RADIO->EVENTS_DISABLED = 0;
    (void) NRF_RADIO->EVENTS_DISABLED;
    NRF_RADIO->TASKS_DISABLE = 1;
    while (NRF_RADIO->EVENTS_DISABLED == 0);
    RFD1.state = NRF52_STATE_IDLE;

    return NRF52_SUCCESS;
}

nrf52_error_t radio_flush_tx(void) {
    if (RFD1.state == NRF52_STATE_UNINIT)
    	return NRF52_INVALID_STATE;

    nvicDisableVector(RADIO_IRQn);

    tx_fifo.count = 0;
    tx_fifo.entry_point = 0;
    tx_fifo.exit_point = 0;

    nvicEnableVector(RADIO_IRQn, NRF52_RADIO_IRQ_PRIORITY);

    return NRF52_SUCCESS;
}

nrf52_error_t radio_pop_tx(void) {
    if (RFD1.state == NRF52_STATE_UNINIT)
    	return NRF52_INVALID_STATE;
    if (tx_fifo.count == 0)
    	return NRF52_ERROR_INVALID_LENGTH;

    nvicDisableVector(RADIO_IRQn);

    if (++tx_fifo.entry_point >= NRF52_TX_FIFO_SIZE) {
        tx_fifo.entry_point = 0;
    }
    tx_fifo.count--;

    nvicEnableVector(RADIO_IRQn, NRF52_RADIO_IRQ_PRIORITY);

    return NRF52_SUCCESS;
}

nrf52_error_t radio_flush_rx(void) {
    if (RFD1.state == NRF52_STATE_UNINIT)
    	return NRF52_INVALID_STATE;

    nvicDisableVector(RADIO_IRQn);

    rx_fifo.count = 0;
    rx_fifo.entry_point = 0;
    rx_fifo.exit_point = 0;

    memset(rx_pipe_info, 0, sizeof(rx_pipe_info));

    nvicEnableVector(RADIO_IRQn, NRF52_RADIO_IRQ_PRIORITY);

    return NRF52_SUCCESS;
}

nrf52_error_t radio_set_base_address_0(uint8_t const * p_addr) {
    if (RFD1.state != NRF52_STATE_IDLE)
    	return NRF52_ERROR_BUSY;
    if (p_addr == NULL)
        return NRF52_ERROR_NULL;

    memcpy(RFD1.config.address.base_addr_p0, p_addr, 4);
    set_addresses(&RFD1, NRF52_ADDR_UPDATE_MASK_BASE0);

    return NRF52_SUCCESS;
}

nrf52_error_t radio_set_base_address_1(uint8_t const * p_addr) {
    if (RFD1.state != NRF52_STATE_IDLE)
    	return NRF52_ERROR_BUSY;
    if (p_addr == NULL)
        return NRF52_ERROR_NULL;

    memcpy(RFD1.config.address.base_addr_p1, p_addr, 4);
    set_addresses(&RFD1, NRF52_ADDR_UPDATE_MASK_BASE1);

    return NRF52_SUCCESS;
}

nrf52_error_t radio_set_prefixes(uint8_t const * p_prefixes, uint8_t num_pipes) {
    if (RFD1.state != NRF52_STATE_IDLE)
    	return NRF52_ERROR_BUSY;
    if (p_prefixes == NULL)
        return NRF52_ERROR_NULL;
    if (num_pipes > 8)
    	return NRF52_ERROR_INVALID_PARAM;

    memcpy(RFD1.config.address.pipe_prefixes, p_prefixes, num_pipes);
    RFD1.config.address.num_pipes = num_pipes;
    RFD1.config.address.rx_pipes = BIT_MASK_UINT_8(num_pipes);

    set_addresses(&RFD1, NRF52_ADDR_UPDATE_MASK_PREFIX);

    return NRF52_SUCCESS;
}

nrf52_error_t radio_set_prefix(uint8_t pipe, uint8_t prefix) {
    if (RFD1.state != NRF52_STATE_IDLE)
    	return NRF52_ERROR_BUSY;
    if (pipe > 8)
    	return NRF52_ERROR_INVALID_PARAM;

    RFD1.config.address.pipe_prefixes[pipe] = prefix;

    NRF_RADIO->PREFIX0 = bytewise_bit_swap(&RFD1.config.address.pipe_prefixes[0]);
    NRF_RADIO->PREFIX1 = bytewise_bit_swap(&RFD1.config.address.pipe_prefixes[4]);

    return NRF52_SUCCESS;
}
